A magnetic head having a magnetoresistive element.
The element comprises a center tap, while on the left-hand half a pattern of equipotential strips is provided at an angle with the longitudinal direction of approximately 45.degree.
and on the right-hand half a pattern of equipotential strips is provided at an angle of approximately 135.degree.
with the longitudinal direction.
The halves are each controlled with a current source and their output signals are subtracted from each other.
The relation between the resistance of the total element and the value of external magnetic fields is more linear than in known magnetic heads having a magnetoresistive element and thermal noise is eliminated.
A narrow track width magnetic head can be formed using an integrated circuit formation techniques such as evaporation plating, chemical etching, etc.
But, there has been such a problem that it is difficult to provide a center tap in a conventional thin film magnetic head structure including coils of four or more turns.
A magnetic head according to the present invention comprising a coil divided into two sections by the center tap, the electrostatic capacitance of each section being substantially the same.
The coil may be formed into a precise pattern with ease by photoetching technique.
A plurality of sets of conductive films insulated from one another are provided crossing a magnetic core, each set consisting of two conductive films of the same pattern.
The alternating layers of the conductive films are connected on the backward of a magnetic gap to provide the two sections of the coil.
A center tap is derived from a connection portion of the two sections of the coil and a coil terminal is provided at each of the opposite free ends of the coil.
Thus, the thin film magnetic head having a multi-turn coil with a center tap is provided.
A thin-film magnetic head having improved playback properties in which the gap-bounding core parts overlap each other laterally while enclosing a layer having a gap and in which a first core part has the shape of a closed loop and is bridged in the center by a second core part.
The parts of the first core part on either side of the bridge are provided with identical coils, while the first core part at the area of the overlap is divided centrally by an extra gap.
Upon playing back, the difference signals of the coils then provides an indication as regards the position relative to the track.
An insulating film substantially free from surface irregularities is RF bias sputtered onto a smooth polycrystalline or micro-roughened surface.
Controlled sputtering is performed first at a low reemission coefficient and then, after a substantially continuous layer of insulative amorphous film is deposited over the substrate, increasing the reemission coefficient to a second higher level.
A low reemission coefficient is about 0.25 and a high coefficient is about 0.7.
In thin film magnetic transducers, e.g., inductive or magnetoresistive recording heads, at least a pair of layers of a ferromagnetic material and an antiferromagnetic material are deposited upon one another and exchange coupled to retain a unidirectional bias in the plane of the ferromagnetic material.
When multiple pairs of layers are used, they are separated by layers of nonmagnetic material.
In some cases, successive pairs of layers of material with unidirectional bias have their directions of bias pointing in opposite directions.
The domain walls in the layers of material are minimized by this technique.
 
